# Business Understanding
### The purpose of this notebook is predict the interset rate for the credit card dataset

## Import necessary Libraries

In [1]:

import pandas as pd
import numpy as np

import warnings # ignore warnings
warnings.simplefilter("ignore")      #Assign predictors & target
from sklearn import preprocessing     

from sklearn.model_selection import train_test_split # Split data

#Models
from sklearn import model_selection
from sklearn.metrics import accuracy_score


from sklearn.ensemble import RandomForestClassifier
from sklearn.preprocessing import StandardScaler   # Feature Scaling for RF

from sklearn.preprocessing import MinMaxScaler


from sklearn.svm import SVC
from sklearn.model_selection import GridSearchCV

from sklearn.model_selection import train_test_split

import sklearn 
from sklearn.metrics import classification_report, confusion_matrix

from sklearn.model_selection import cross_val_score

# Preproccessing

In [2]:
small_business = pd.read_csv('datasets/small_business.csv')
small_business.head(n=10)

,Column,loan_amnt,funded_amnt,int_rate,installment,grade,emp_length,annual_inc,loan_status,purpose,addr_state,last_pymnt_amnt,avg_cur_bal,num_actv_rev_tl
0,46,20000,20000,20.00,743.28,4,1.0,80000.0,Fully Paid,small_business,NJ,20288.89,6.0,11
1,102,14000,14000,12.40,314.26,6,8.0,190000.0,Fully Paid,small_business,WA,14130.20,87775.0,3
2,165,39075,39075,11.02,1279.64,6,1.0,1750000.0,Fully Paid,small_business,MI,39725.82,13251.0,4
3,199,10000,10000,12.40,334.06,6,1.0,30000.0,Charged Off,small_business,ME,334.06,34004.0,3
4,219,20000,20000,10.33,648.45,6,10.0,120000.0,Fully Paid,small_business,MD,20143.47,15014.0,2
5,381,16000,16000,16.40,565.68,5,2.0,120000.0,Fully Paid,small_business,IN,16024.49,281.0,8
6,405,35000,35000,15.57,1223.08,5,1.0,90000.0,Fully Paid,small_business,NV,35123.82,5202.0,2
7,717,10000,10000,13.08,337.33,6,NaN,70000.0,Charged Off,small_business,TX,337.33,5258.0,5
8,797,30000,30000,6.46,918.93,7,10.0,80000.0,Fully Paid,small_business,CA,30027.08,40121.0,4
9,837,40000,40000,7.56,1245.36,7,3.0,150000.0,Charged Off,small_business,WI,0.00,4046.0,12

In [3]:
small_business.shape

(48, 14)

# Since it has the same columns as Credit_card dataset, we will follow the same process

In [4]:
small_business.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48 entries, 0 to 47
Data columns (total 14 columns):
Column             48 non-null int64
loan_amnt          48 non-null int64
funded_amnt        48 non-null int64
int_rate           48 non-null float64
installment        48 non-null float64
grade              48 non-null int64
emp_length         46 non-null float64
annual_inc         48 non-null float64
loan_status        48 non-null object
purpose            48 non-null object
addr_state         48 non-null object
last_pymnt_amnt    48 non-null float64
avg_cur_bal        48 non-null float64
num_actv_rev_tl    48 non-null int64
dtypes: float64(6), int64(5), object(3)
memory usage: 5.3+ KB

In [5]:
small_business.dropna(inplace = True)

In [6]:
small_business['int_rate'] = small_business.int_rate.astype(int)
small_business['installment'] = small_business.int_rate.astype(int)
small_business['emp_length'] = small_business.int_rate.astype(int)
small_business['annual_inc'] = small_business.int_rate.astype(int)
small_business['int_rate'] = small_business.int_rate.astype(int)
small_business['int_rate'] = small_business.int_rate.astype(int)

In [7]:
small_business.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 46 entries, 0 to 47
Data columns (total 14 columns):
Column             46 non-null int64
loan_amnt          46 non-null int64
funded_amnt        46 non-null int64
int_rate           46 non-null int64
installment        46 non-null int64
grade              46 non-null int64
emp_length         46 non-null int64
annual_inc         46 non-null int64
loan_status        46 non-null object
purpose            46 non-null object
addr_state         46 non-null object
last_pymnt_amnt    46 non-null float64
avg_cur_bal        46 non-null float64
num_actv_rev_tl    46 non-null int64
dtypes: float64(2), int64(9), object(3)
memory usage: 5.4+ KB

In [8]:
small_business.drop('purpose', axis=1, inplace=True)

In [9]:
small_business.head()

,Column,loan_amnt,funded_amnt,int_rate,installment,grade,emp_length,annual_inc,loan_status,addr_state,last_pymnt_amnt,avg_cur_bal,num_actv_rev_tl
0,46,20000,20000,20,20,4,20,20,Fully Paid,NJ,20288.89,6.0,11
1,102,14000,14000,12,12,6,12,12,Fully Paid,WA,14130.20,87775.0,3
2,165,39075,39075,11,11,6,11,11,Fully Paid,MI,39725.82,13251.0,4
3,199,10000,10000,12,12,6,12,12,Charged Off,ME,334.06,34004.0,3
4,219,20000,20000,10,10,6,10,10,Fully Paid,MD,20143.47,15014.0,2

In [10]:
small_business.drop('Column', axis=1, inplace=True)

In [11]:
small_business.head()

,loan_amnt,funded_amnt,int_rate,installment,grade,emp_length,annual_inc,loan_status,addr_state,last_pymnt_amnt,avg_cur_bal,num_actv_rev_tl
0,20000,20000,20,20,4,20,20,Fully Paid,NJ,20288.89,6.0,11
1,14000,14000,12,12,6,12,12,Fully Paid,WA,14130.20,87775.0,3
2,39075,39075,11,11,6,11,11,Fully Paid,MI,39725.82,13251.0,4
3,10000,10000,12,12,6,12,12,Charged Off,ME,334.06,34004.0,3
4,20000,20000,10,10,6,10,10,Fully Paid,MD,20143.47,15014.0,2

In [12]:
labels_loanStatus = small_business['loan_status'].astype('category').cat.categories.tolist()
replace_map_loan_status = {'loan_status' : {k: v for k,v in zip(labels_loanStatus,list(range(1,len(labels_loanStatus)+1)))}}
print(replace_map_loan_status)

{'loan_status': {'Charged Off': 1, 'Fully Paid': 2}}

In [13]:
small_business.replace(replace_map_loan_status, inplace=True)

In [14]:
labels_addr_state = small_business['addr_state'].astype('category').cat.categories.tolist()
replace_map_comp_addr_state = {'addr_state' : {k: v for k,v in zip(labels_addr_state,list(range(1,len(labels_addr_state)+1)))}}
print(replace_map_comp_addr_state)

{'addr_state': {'CA': 1, 'CO': 2, 'CT': 3, 'FL': 4, 'GA': 5, 'ID': 6, 'IN': 7, 'MD': 8, 'ME': 9, 'MI': 10, 'MT': 11, 'NC': 12, 'NE': 13, 'NH': 14, 'NJ': 15, 'NV': 16, 'NY': 17, 'RI': 18, 'SC': 19, 'TX': 20, 'UT': 21, 'VA': 22, 'WA': 23, 'WI': 24}}

In [15]:
small_business.replace(replace_map_comp_addr_state, inplace = True)

In [16]:
small_business.head()

,loan_amnt,funded_amnt,int_rate,installment,grade,emp_length,annual_inc,loan_status,addr_state,last_pymnt_amnt,avg_cur_bal,num_actv_rev_tl
0,20000,20000,20,20,4,20,20,2,15,20288.89,6.0,11
1,14000,14000,12,12,6,12,12,2,23,14130.20,87775.0,3
2,39075,39075,11,11,6,11,11,2,10,39725.82,13251.0,4
3,10000,10000,12,12,6,12,12,1,9,334.06,34004.0,3
4,20000,20000,10,10,6,10,10,2,8,20143.47,15014.0,2

In [17]:

y=small_business['int_rate']
X = small_business.drop('int_rate', axis=1)

In [18]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.25,random_state=0)

In [19]:
X_train.shape

(34, 11)

In [20]:
X_test.head()

,loan_amnt,funded_amnt,installment,grade,emp_length,annual_inc,loan_status,addr_state,last_pymnt_amnt,avg_cur_bal,num_actv_rev_tl
27,5000,5000,8,7,8,8,1,19,158.56,6164.0,3
24,12000,12000,6,7,6,6,2,20,12036.61,4255.0,3
30,5000,5000,14,5,14,14,2,4,917.24,33420.0,1
4,20000,20000,10,6,10,10,2,8,20143.47,15014.0,2
11,10000,10000,8,7,8,8,2,1,10027.36,1737.0,4

In [21]:
y_train.head()

44     7
2     11
47    10
20    17
17    23
Name: int_rate, dtype: int64

In [22]:
y_test.shape

(12,)

In [23]:
clf = RandomForestClassifier(n_jobs=2, random_state=0)

clf.fit(X_train, y_train)
RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='auto', max_leaf_nodes=None,
            min_impurity_split=1e-07, min_samples_leaf=1,
            min_samples_split=2, min_weight_fraction_leaf=0.0,
            n_estimators=10, n_jobs=2, oob_score=False, random_state=0,
            verbose=0, warm_start=False)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=None, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=1e-07,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=10, n_jobs=2,
                       oob_score=False, random_state=0, verbose=0,
                       warm_start=False)

In [24]:
preds = clf.predict(X_test)

In [25]:
pd.crosstab(y_test, preds, rownames=['Actual Result'], colnames=['Predicted Result'])

Predicted Result  7   8   10  12  15  16  19
Actual Result
6                  1   0   0   0   0   0   0
7                  1   0   0   0   0   0   0
8                  1   1   0   0   0   0   0
10                 0   0   2   0   0   0   0
14                 0   0   0   1   1   0   0
16                 0   0   0   0   1   0   0
17                 0   0   0   0   0   1   0
22                 0   0   0   0   0   0   1
23                 0   0   0   0   0   0   1

In [26]:
#2 

# Feature Scaling (Normalize x)
sc = StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

#RF
clf=RandomForestClassifier(n_estimators=300)

clf.fit(X_train,y_train)

# Make predictions on test data
y_pred=clf.predict(X_test)

from sklearn import metrics
# Model Accuracy, how often is the classifier correct?
print("Accuracy:",metrics.accuracy_score(y_test, y_pred))

Accuracy: 0.5833333333333334

In [27]:
model2 = RandomForestClassifier(n_estimators=300,max_depth=800)
model2.fit(X_train,y_train)
predictions2 = model2.predict(X_test)

print(('Testing Accuracy: %.5f') % (accuracy_score(y_test, predictions2)))
print(('Training Accuracy: %.5f') % (accuracy_score(y_train, model2.predict(X_train))))
print()

Testing Accuracy: 0.50000
Training Accuracy: 1.00000

In [28]:
# reference: https://towardsdatascience.com/random-forest-in-python-24d0893d51c0
def pred_score(model):
    pred = model.predict(X_test)
    # Calculate the absolute errors
    errors = abs(pred - y_test)
    # Calculate mean absolute percentage error
    mape = 100 * (errors / y_test)
    accuracy = 100 - np.mean(mape)
    return round(accuracy, 2)

In [29]:
from sklearn.linear_model import LogisticRegression

logreg = LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=110, multi_class='ovr', n_jobs=1,
          penalty='l1', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

logreg.fit(X_train, y_train)
print(f'Accuracy of Logistic regression classifier on training set: {round(logreg.score(X_train, y_train)*100,2)}%.')

Accuracy of Logistic regression classifier on training set: 64.71%.

In [30]:
from sklearn.neighbors import KNeighborsClassifier

knn = KNeighborsClassifier(algorithm='auto', leaf_size=15, metric='minkowski',
 metric_params=None, n_jobs=1, n_neighbors=3, p=2,
 weights='uniform')

knn.fit(X_train, y_train)
print(f'Accuracy of K-NN classifier on training set: {round(knn.score(X_train, y_train)*100,2)}%.')

Accuracy of K-NN classifier on training set: 55.88%.

In [31]:
from sklearn.tree import DecisionTreeClassifier

dt = DecisionTreeClassifier()

dt.fit(X_train, y_train)
print(f'Accuracy of Decision Tree classifier on training set: {round(dt.score(X_train, y_train)*100,2)}%.')

Accuracy of Decision Tree classifier on training set: 100.0%.

In [32]:
from sklearn.svm import SVC

svm = SVC(kernel='linear')

svm.fit(X_train, y_train)
print(f'Accuracy of SVM classifier on training set: {round(svm.score(X_train, y_train)*100,2)}%.')

Accuracy of SVM classifier on training set: 97.06%.